backend/app/controllers/concerns/api/v1/items_controller.rb

INSERT INTO "items" ("admin_id", "category_id", "created_at", "description", "name", "updated_at", "value") VALUES (88, 57, '2026-07-08 00:17:24.826442', 'salame :OO', 'Salame', '2026-07-08 00:17:24.826442', NULL) RETURNING "id"
---
  def create
    @item = Item.new(item_params)
    @item.admin = current_admin

    if @item.save