backend/app/controllers/api/v1/categories_controller.rb

INSERT INTO "categories" ("admin_id", "created_at", "name", "updated_at") VALUES (1, '2026-07-15 01:31:05.810801', 'teste', '2026-07-15 01:31:05.810801') RETURNING "id"
---
  def create
    @category = Category.new(category_params)
    @category.admin = current_admin

    if @category.save

DELETE FROM "categories" WHERE "categories"."id" = 1
---
  def destroy
    @category.destroy!

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
---
    def set_category
      @category = Category.find(params.expect(:id))