backend/app/controllers/api/v1/items_controller.rb

  def index
    @items = Item.all.with_attached_photo

    render json: @items.map { |item| format_item(item) }
---
SELECT "items".* FROM "items"

  def create
    @item = Item.new(item_params)
    @item.admin = current_admin

    if @item.save
---
INSERT INTO "items" ("admin_id", "category_id", "created_at", "description", "name", "updated_at", "value") VALUES (1, 1, '2026-07-15 01:31:11.583964', 'bdsaads', 'a', '2026-07-15 01:31:11.583964', 2323.0) RETURNING "id"

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "name" = $1, "updated_at" = $2, "value" = $3 WHERE "items"."id" = $4  [["name", "Batata Frita Especial"], ["updated_at", "2026-07-07 23:08:36.911548"], ["value", "18.9"], ["id", 5]]

  def destroy
    @item.destroy!
---
DELETE FROM "items" WHERE "items"."id" = 1

    def set_item
      @item = Item.find(params.expect(:id))
---
SELECT "items".* FROM "items" WHERE "items"."id" = 2 LIMIT 1